{"body": ["B\ny Jonathan Stempel and Carolina Mandl", "OMAHA, Neb., April 30 (Reuters) - Warren Buffett's Berkshire Hathaway Inc BRKa.N holds its hotly-anticipated annual shareholder meeting in person on Saturday for the first time since before the pandemic, where shareholders will have the chance to quiz the so-called 'Oracle of Omaha' on everything from corporate governance, potential new investments and Buffett's views on the economy.", "Buffett, 91, chairman and chief executive officer of Berkshire, and Vice Chairman Charlie Munger, 98, will answer shareholder questions for roughly five hours when the meeting convenes in Omaha, Nebraska. Joining them will be Vice Chairmen Greg Abel, Buffett's designated successor as CEO, and Ajit Jain.", "Some shareholders started lining up early to get a good seat.", "Andres Avila from Boston, a huge fan of Buffett, arrived at Berkshire Hathaway's hometown just five hours before the meeting. It left him with almost no time to sleep before the meeting, as he wanted to get in line at 4:45am.", "\"I said: I'm already doing the trip for this. I just might as well get the best seat I can\", said Avila, holding a big umbrella as it was raining at dawn. \"I have a bunch of my idols here.\"", "The meeting may address issues such as recent investments, a still-swollen cash pile, share buybacks, rising inflation and supply chain disruptions, and even whether someone other than Buffett should chair the company.", "Some investors have begun to increase pressure on the conglomerate, which spans businesses from insurance to energy to candy. Calpers, the largest U.S. public pension fund, and other investors are demanding that Berkshire replace Buffett with an independent chair, and disclose how its dozens of businesses promote diversity and address climate risks and mitigation. Buffett would remain chief executive officer.", "Many shareholders, however, attend for more than just the annual meeting.", "Events around the city over three days include a 5-km run, shareholder shopping from dozens of Berkshire-owned businesses at the downtown CHI Health Center arena where the meeting takes place, and several private investing conferences.", "Berkshire has been expecting attendance to be \"considerably less\" than the 40,000, many from overseas, common to recent meetings. The 2019 meeting, the last in-person meeting before the pandemic, added $21.3 million to Omaha's economy.", "The meeting will be broadcast online at cnbc.com. Berkshire first webcast meetings in 2016.", "Berkshire also reported its earnings on Saturday morning.", "(Reporting by Jonathan Stempel and Carolina Mandl in Omaha, Nebraska; editing by Megan Davies, Diane Craft and Ros Russell)", "((jon.stempel@thomsonreuters.com; +1 646 223 6317; Reuters Messaging: jon.stempel.thomsonreuters.com@reuters.net))", "", "The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], "date": "2022-04-30T08:21:32-0400", "headline": "Warren Buffett's Berkshire all-day meeting to kick off in Omaha", "url": "https://www.nasdaq.com/articles/warren-buffetts-berkshire-all-day-meeting-to-kick-off-in-omaha-0"}