{"body": ["O\nne of the big fallouts from the pandemic has been the supply crunch in the semiconductor industry. When the world shut down in 2020, many companies decreased their order books for computer chips, which caused semiconductor manufacturers to stop investing for growth.", "However, just a few months later, demand for computer chips was skyrocketing as people wanted more computers and car manufacturers started to ramp up growth again (cars have tons of computer chips in them). This has caused a supply chain crunch in the semiconductor industry that has lasted for almost two years, impacting industries ranging from automotive to video games.", "According to executives at leading semiconductor companies Taiwan Semiconductor Manufacturing (NYSE: TSM), ASML Holding (NASDAQ: ASML), and Applied Materials (NASDAQ: AMAT), these supply shortages are far from over. What does this mean for the industry moving forward?", "Image source: Getty Images.", "The choke point in the semiconductor industry is Taiwan Semiconductor Manufacturing (or just TSMC). The company manufactures over 50% of the world's computer chips for companies like Apple, Nvidia, and Advanced Micro Devices. Chip designers love to outsource their manufacturing to TSMC because of its decades of expertise and ability to make the most advanced chips on the market.", "However, in order to achieve this, TSMC has to invest heavily in growth. In 2022, it plans to spend $40 billion to $44 billion on capital expenditures to fulfill future customer demand.", "But in order to build more chips, TSMC needs highly specialized equipment from other manufacturers around the world. And right now, these equipment makers are struggling to fulfill the orders TSMC and other semiconductor manufacturers are sending out.", "Here's a TSMC executive on its latest earnings call:", "As a major player in the global semiconductor supply chain, TSMC worked closely with all our tool suppliers to plan our capex and capacity in advance. However, like many other industries, our suppliers are facing great challenges in their supply chain from the continued impact of COVID-19, which are creating labor component and chip constraint in their supply chains and extending toward delivery lead time for both advanced and mature nodes.", "In simple terms, TSMC cannot fulfill its customers' orders because it can't get enough equipment to make semiconductors in a timely manner. This is creating a bottleneck in industries around the globe, subsequently creating shortages of new automobiles and video game consoles, among other products.", "So why can't TSMC get all the equipment it needs? Because its semiconductor equipment suppliers like Applied Materials and ASML are already operating at full capacity and facing material constraints themselves.", "In its Q1 2022 earnings call in February, Applied Materials executives said its customer backlog had reached a record $8 billion and that \"the industry clearly has a long way to go before supply catches up with demand.\" If it is unable to get enough components and materials to build its complicated equipment, this backlog will continue in upcoming quarters.", "Another big equipment supplier similar to Applied Materials is ASML. The Dutch company is crucial for the advanced semiconductor manufacturing lines that TSMC is known for. In its Q1 earnings report, executives said they are seeing unprecedented demand right now and that demand should exceed supply \"well into next year.\"", "As long as the equipment makers are unable to fulfill all the industry's demands, there will be a shortage of computer chips for consumer products. And according to executives at the heart of the supply chain, these shortages should continue for at least another year, if not longer.", "Since the semiconductor industry has a history of being cyclical, many investors are worried that companies are overbuilding and that a supply glut will occur. A glut would dry up demand and likely severely hurt the financials of all players in the industry. This is why a company like Applied Materials trades at a forward price-to-earnings (P/E) of 12.8, well below the market average. Investors just don't trust this demand is sustainable.", "A supply glut could occur eventually, but if you trust what these executives are saying, the industry is at least a year or two, if not longer, from overbuilding capacity. This is great news not only for a manufacturer like TSMC but especially for equipment makers like Applied Materials and ASML. At a discounted valuation, this means now could be a good time to pick up some shares of Applied Materials or other semiconductor companies on the cheap.", "10 stocks we like better than Applied Materials\nWhen our award-winning analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*", "They just revealed what they believe are the ten best stocks for investors to buy right now... and Applied Materials wasn't one of them! That's right -- they think these 10 stocks are even better buys.", "See the 10 stocks", "", "*Stock Advisor returns as of April 7, 2022", "", "Brett Schafer has no position in any of the stocks mentioned. The Motley Fool owns and recommends ASML Holding, Advanced Micro Devices, Apple, Applied Materials, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: long March 2023 $120 calls on Apple and short March 2023 $130 calls on Apple. The Motley Fool has a disclosure policy.", "", "The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], "date": "2022-04-30T08:13:00-0400", "headline": "The Semiconductor Shortage Is Far From Over, According to Industry Executives", "url": "https://www.nasdaq.com/articles/the-semiconductor-shortage-is-far-from-over-according-to-industry-executives"}