{"body": ["G\nPS device maker Garmin (NYSE: GRMN) announced first-quarter earnings this week, showing the company remains on track to grow revenue about 10% this year. While that might not be the kind of growth some investors want from technology stocks, looking at the bigger picture of Garmin as an investment offers more support to own the stock.", "If the company does achieve a double-digit, year-over-year revenue increase in 2022, it will be a continuation of its five-year annual rate of 10.5%. While that growth does look likely to continue based on what the company just reported, the stock itself also offers investors a reliable dividend yield and a good valuation at its recent price.", "Image source: Garmin.", "Some people still think of Garmin as the maker of personal navigation devices (PNDs) that drivers would adhere to car dashboards and windshields. The use of smartphone apps drove that business away. But Garmin was ready for the transition.", "Garmin shifted from automobiles to other GPS devices over the last decade.", "As shown above, while its automotive/mobile segment represented 70% of company sales in 2009, that has been shifting dramatically over the past decade. By 2021, that was only 12%, while fitness, outdoor, aviation, and marine devices grew to dominate Garmin sales. Additionally, the auto/mobile segment is back in growth mode as the company works with automotive original equipment manufacturers (OEMs) that use its built-in systems.", "The more-recent product mix has several aspects of Garmin's business trending higher. In addition to the aforementioned annual revenue growth, gross profit has been increasing even faster.", "For Garmin, gross profit has been growing faster than revenue.", "A five-year annual growth rate of 11.3% in gross profit shows management is skilled at managing costs to increase profitability faster than revenue over the last five years. For perspective, comparing that to another popular wearable device maker, Garmin's gross profit margin was 58% in 2021 while Apple's was 42% last year.", "", "", "Hearing a company CEO say he is \"optimistic about the future,\" as Garmin CEO Cliff Pemble said during the first-quarter conference call, isn't a surprise. But there are some good reasons he should be. And the company is backing up that optimism with its newly authorized $300 million share repurchase plan. The buyback would be the first in four years, and complements a dividend that recently yielded 2.45%.", "Management's confidence largely comes from the growing sales in all of its segments. The previously noted shift of dominance away from the automotive segment didn't just come from falling sales in that segment. Over the last five years, the other growth drivers have been sharply accelerating.", "Data source: Garmin financial releases. Chart by author.", "But sales from the automotive segment have also now begun to climb. As shown above, the segment reversed a years-long decline last year -- and in the first quarter of 2022, auto/mobile revenue actually increased 11% year over year.", "The company also ended the first quarter with about $3 billion of cash and marketable securities on its balance sheet, adding another reason to hold Garmin stock. There is plenty of cash to boost returns for shareholders, either through business investments, increasing dividends, or buybacks in the future, too.", "", "", "Find out why Garmin is one of the 10 best stocks to buy now", "Our award-winning analyst team has spent more than a decade beating the market. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*", "They just revealed their ten top stock picks for investors to buy right now. Garmin is on the list -- but there are nine others you may be overlooking.", "Click here to get access to the full list!", "", "*Stock Advisor returns as of April 7, 2022", "", "Howard Smith has positions in Apple and Garmin. The Motley Fool has positions in and recommends Apple and Garmin. The Motley Fool recommends the following options: long March 2023 $120 calls on Apple and short March 2023 $130 calls on Apple. The Motley Fool has a disclosure policy.", "", "The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."], "date": "2022-04-30T10:15:00-0400", "headline": "Here's Why Investors Should Hold Garmin Stock", "url": "https://www.nasdaq.com/articles/heres-why-investors-should-hold-garmin-stock"}